Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/P05.tmx
Source language: en_us
Languages: zh_cn

source: Homecoming Gift Chapter1
zh_cn: 归来的礼物 第一章

source: There were three things that a soldier never, ever wanted to hear.
zh_cn: 有三样事物，是一名士兵永远都不想得知的。

source: The first, of course, was word that a comrade had fallen: died on the field, perished during a mission- sacrificed his or her own life in order to save countless others.
zh_cn: 第一件，当然就是战友已经倒下：战死沙场，或者在执行任务时牺牲——为了拯救他人而抛弃自己的生命。

source: No matter the reason, there was no greater sadness than having to say goodbye to a colleague... a friend.
zh_cn: 不论原因若何，再没有其他事物能如同不得不与一名同袍...或者伙伴生死离别时那样令人悲伤。

source: The second was equally horrible, but in an entirely different (and more terrifying) way: to discover that you, as a combatant, had made some sort of grievous mistake, and as a result had put others at risk.
zh_cn: 第二件也同样可怖，不过却是以完全不同（而且这更加可怕）的方式出现：发现自己作为一名战士却犯下大错，结果是将其他人推向危险的边缘。

source: Never mind the verbal abuse that resulted; never mind the punishment from superior officers. Just hearing the words "miscalculation" or "error" or "carelessness" was enough to make one's stomach drop and heart turn to lead.
zh_cn: 由此而来的咒骂和长官的责罚都是无关紧要的，单单是听到“情况估计错误”或者“出错了”或者“粗心犯错”之类的话语都足以令人心惊肉跳，如坠地狱。

source: The third thing, while perhaps less dire from a militaristic standpoint, did a horrendous number to an individual's morale, and could thus inadvertently result in situations one or two: "dear John."
zh_cn: 第三件，“再见，约翰”绝情书（原文为Dear John，稍曲意译之）。虽然或许站在一个军人的角度来说没那么骇人，对于个人来说却是一件足以影响士气的大事，而且因此会在不经意间导致前两种悲剧发生。

source: In writing, in speech... Euphemistically or literally, depending on a soldier's given name.
zh_cn: 在笔下或口头，绝情绝意委婉而至，如果那名士兵原本即名约翰，可就算是痛心直击了。

source: In Sosuke's case, neither format would have made for a very pleasant experience.
zh_cn: 而且，对于相良宗介来说，哪一样都算不上愉快的体验。

source: But of all three of these terrible things, the last one troubled him the least.
zh_cn: 不过，在以上三样可畏事物中，后者困扰不多。

source: That was to say, the third was the one that he felt he was least likely to encounter in his own life.
zh_cn: 这就是说，他不觉得这辈子有幸收到一封绝情信的机会能有好几回。

source: After all, the first had already happened to him- more times than he cared to think about.
zh_cn: 毕竟，在他的周围，战友间的永别时常发生——数目多得他都来不及有所感怀。

source: He had also made mistakes in his career, and recognized that (no matter how hard he might try), he was bound to screw up again.
zh_cn: 在他的人生中也犯过错误，宗介也意识到（不论花了多大的气力去避免），他总会再次犯错。

source: Even if he wasn't consciously aware of his slip-ups, or if a certain reaction didn't seem (in his eyes, anyway) to be an error of judgment, others would undoubtedly point out his blunders to him.
zh_cn: 即使他还没有意识到错误的发生，或者在他看来，自己的应对还算不上失误，其他人都会言之凿凿地告诉他“又是你！”

source: "Others" like his wife, for instance.
zh_cn: 打个比方，这里的“其他人”好比他的妻子。

source: And yet, for all of his faults- and he did have many of them, or so Kaname assured- he never thought that they'd be enough to rip them apart.
zh_cn: 不过，尽管他犯下了许多错误——或者说那些小要可以拍胸脯肯定是他犯的错误——他从未想过那些就足以把他俩彼此分开。

source: Indeed, if there was one thing that he was sure of, one thing that he was positive would never change, it was that she loved him, and that he loved her.
zh_cn: 确实，如果有一件事是宗介足以确信的，也是他自信永远不会改变的，那就是：她爱他，而且他也爱她。

source: Perhaps more than it was healthy to...Which was why Sosuke was fairly certain that he stopped breathing when Kaname shot him that pity-filled, wholly-guilty glance.
zh_cn: 这就是为什么小要在投给他一个充满遗憾和歉疚的眼神后，宗介感到自己的呼吸都要停止了。

source: "...Kaname?"
zh_cn: “...小要？”

source: His hand was still on the door knob, his body half-in and half-out of their little apartment.
zh_cn: 他的手还扶在门把上，半个身子刚探入他们小小的公寓。

source: He'd been gone for six months on active duty- he'd been certain that she'd be happy to see him.
zh_cn: 宗介已经服役离家6个月了——很确信小要见到他时一定很开心。

source: He'd rather expected a hug, if nothing else; hell, she'd been known to attack him with a flying glomp after only having been gone for a few days.
zh_cn: 他甚至期待一次拥抱，如果没有其他表示的话——天啊，以前才离开几天她就会用一记飞踢招呼他了。

source: But no- instead, she watched her husband from the distant kitchen, seated stiffly at the table, content to keep a hallway's worth of space between them.
zh_cn: 但是，什么都没有发生——她只是从厨房里望着丈夫，呆板地坐在桌边，两人之间隔着一整个玄关。

source: "Kaname, is something the matter?"
zh_cn: “小要，有什么不对吗？”

source: No response.
zh_cn: 她没有回答。

source: Sosuke would be lying if he said that he wasn't hurt by her apparent apathy- they hadn't seen each other for half a year!
zh_cn: 如果要说宗介一点都没为她显而易见的冷漠感到难过就太不靠谱了——他们已经半年没见面了！

source: What was with the cold shoulder?- but it was his nature to act on suspicions, rather than personal feelings.
zh_cn: 这种冷遇是怎么回事？——但是保持怀疑而不是放任冲动才是宗介的本性。

source: And he found the entire situation very, very suspicious...
zh_cn: 而且他发现整个情形实在、非常值得怀疑...

source: Was a terrorist around the corner?
zh_cn: 恐怖分子在附近吗？

source: Was there a firearm being pointed at her, at that moment?
zh_cn: 现在她正被枪指着？

source: Was she being restrained in some way?
zh_cn: 还是她被某种方式拘禁了？

source: If that was the case,she didn't seem overly worried...
zh_cn: 如果是那样，她却显得不那么慌张...

source: Rather, she was watching him awkwardly, manicured nails clicking against the porcelain of her coffee cup.
zh_cn: 相反，她直直地看着他，修剪整齐的指甲轻敲着手中的瓷制咖啡杯。

source: She had set a mug out for him, as well.
zh_cn: 桌上还为他准备好了杯子。

source: "...Sosuke," Kaname cleared her throat, biting down on her bottom lip.
zh_cn: “...宗介...”小要清了清嗓子，紧咬着下唇。

source: Now she seemed a little anxious...
zh_cn: 现在她看起来有些焦虑了...

source: Perhaps there was a threat in the vicinity, after all?
zh_cn: 也许果然威胁就在附近？

source: He carefully maneuvered his hand around the handle of his Glock, just in case.
zh_cn: 他小心翼翼地把手移向格洛克（名枪，小说里宗介用的是Glock19，动画版则换为更小巧的G26——译注）的握把，以防万一。

source: "Sosuke, we need to talk."
zh_cn: “宗介，我们得谈谈。”她说。

source: A pause.
zh_cn: 她稍稍停顿片刻。

source: "...and get your hand off of that gun, there's no one dangerous around for miles."
zh_cn: “...还有，把手从枪上挪开，周围没有任何危险。”

source: The soldier felt himself relax slightly, reassured by the familiar, steely glint in his charge's gaze.
zh_cn: 士兵感到自己稍稍放松了些，那种凝视着他紧绷目光的熟悉而坚强的眼神释去了他的疑虑。

source: But the biting irritation brought about by his antics was soon replaced by another embarrassed glitter of ignominy, and she looked down into her drink again as she waited for him to shuffle into the room.
zh_cn: 不过被他的古怪举动而激起的情感波澜很快被另一阵羞惭的尴尬所代替，她再一次低头盯着杯子，等着他一点一点谨慎地挪进房间。

source: After double-checking for bombs or gunmen or who-knew-the-hell-what, Sosuke eased himself into the chair opposite his wife, and lightly folded his hands.
zh_cn: 再三检查确认没有炸弹或者枪手或者...天知道他在检查些什么，之后，宗介在妻子对面放松地坐下，轻轻地叠合双手。

source: It was a pose he often took when awaiting measures of peaceful reconciliation with Kaname, post-argument.
zh_cn: 这个小动作常常表示他在争吵后期待着与小要和好。

source: And when his wife was looking as shamefaced as she currently did, he assumed that he would be apologizing for something, and fairly soon.
zh_cn: 而且当他的妻子就像眼下这样羞涩地看着他时，宗介就明白自己很快就能为什么事情道歉来解决争议了。

source: But oddly, Kaname seemed to be the repentant party, this time.
zh_cn: 但是，奇怪的是，看起来小要这次才是改悔的一方。

source: "I'm sorry," she whispered, nibbling nervously on the very tip of her tongue. "I... Looking back, this is definitely not the way that I... that is... I didn't- don't- want to hurt you, but I..."
zh_cn: “对不起，”她轻声说道，一点一点地吐出字句，“我...回忆了之后，肯定不会是...那是...我从没有——现在也没有——想要伤害你，但我...”

source: She trailed off feebly, leaving Sosuke more bewildered than ever.
zh_cn: 她的声音弱了下去，宗介从来没有这么困惑过。

source: His state of befuddlement was only perpetuated by the fact that her nerves were catching; the more she bashfully avoided his stare, the more her fingers clenched and unclenched, the more she generally looked uncomfortable, the more Sosuke began to feel the same.
zh_cn: 她的局促不安延续了他的迷惑，她越是羞涩地想要回避他的目光，手指就越是纠缠不停，越是看起来忐忑不安，宗介就越是感同身受。

source: And his mind started to drift into dangerous waters, remembering the third thing that a soldier never wanted to hear...
zh_cn: 随后他警觉起来，想起了那第三样士兵绝对不会想到听到的事情...

source: "Kaname, what's going on?"
zh_cn: “小要，发生了什么？”

source: "I- " The young woman hesitated, wincing. Screwed her face up. Tried again. "Sosuke, I don't know quite how to put this...
zh_cn: “我——”年轻的女子犹疑畏缩着，绷紧了面孔，又开口尝试了一次，“宗介，我真的不知道该怎么说出口...

source: I really should have said something earlier, but I...
zh_cn: 我应该早点说的，但是我...

source: I didn't know what this news would do to you, you know, emotionally, and I didn't want to put you in danger because of it...
zh_cn: 我不知道你会有什么反应...情绪上...你知道的，而且我不想让你因此陷入危险...

source: I mean, you needed to keep your wits about you out there, and I knew that a change like this... well..."
zh_cn: 我是说，你需要在战场上保持机敏，而我明白这种改变就像...就像...”

source: He waited patiently as she continued to babble, looking close to tears.
zh_cn: 他耐心的等待着她含糊不清的话语，她看起来几乎要哭出来了。

source: "Plus, I... I didn't want to say it over the phone, or in a letter.
zh_cn: “再加上，我...我不想在电话或者信里说这事。

source: That just seemed...
zh_cn: 那样就好像...

source: I dunno, tacky, and...
zh_cn: 我不知道，那有些古怪，而且...

source: and- "
zh_cn: 而且——”

source: "Kaname."
zh_cn: “小要。”

source: His voice was quiet, somber.
zh_cn: 他的声音低沉而阴郁。

source: It caught his wife temporarily off-guard.
zh_cn: 令她有些措手不及。

source: Startled out of her ramblings, she looked up to find that their roles had revered: now he was the one who was averting his gaze, trying to hide the emotions that his metal-gray irises would have reflected.
zh_cn: 从自己杂乱无章的话语中惊醒过来，她抬起头来发现两人的角色完全对调了：现在是他开始目光闪烁，试图掩藏他铁灰色的瞳孔中反射出的情感。

source: "Kaname, it is not necessary for you to say any more.
zh_cn: “小要，你不用多说了。

source: I realize that being the spouse of a Mithril agent must put you under a great deal of unbearable stress... it is only natural to wish for a more stable life.
zh_cn: 我明白当一个秘银（Mithril，宗介服役的雇佣兵部队，主要职责为反恐和维和——译注）特工的妻子会给你带来多少沉重的压力...想要一种安定的生活总是没错的。

source: If... if it is a divorce that you are looking for..."
zh_cn: 如果...如果你想要离婚...”

source: He swallowed painfully.
zh_cn: 他费力地吞吐着。

source: And she, in return, offered a loud snort. "...what?"
zh_cn: 而她则回应以疑惑的鼻息，“...什么？”

source: Kaname gawked, nothing but pure, unadulterated puzzlement in her response.
zh_cn: 小要呆呆地说，完全被搞糊涂了。

source: Well, puzzlement and a note of startled laughter- the sort of uncontrollable amusement that one often found in the aftermath of an atrocious misunderstanding. And what a welcome sound it was...
zh_cn: 片刻之后笑出声来——是那种误会解除后控制不住的笑声。吃吃地笑声钻进宗介的耳朵...这是他多么乐意听到的声音啊。

source: The irrepressible giggle perked Sosuke's ear; he found the courage to meet his wife's eyes again, heartened by the small smile forming on her face.
zh_cn: 他发现自己又有了勇气直视妻子的双眼，她脸上浮现出的一丝笑容使他振作起来。

source: "No, Sosuke, that's not what I'm saying at all- !"
zh_cn: “不，宗介，那根本不是我想要说的——！”

source: But the sergeant was no longer paying attention, for his very attentive ears had picked up another noise, as well: and this one was disturbingly out-of-place.
zh_cn: 但是这时军士的注意力已经转移，因为他灵敏的双耳同时捕捉到了另一种声音：一种令人不安而又格格不入的声响。

source: Two yards down the adjacent hallway- concealed by the darkness that lurked beyond the cracked door.
zh_cn: 沿着玄关，两码之外——隐蔽在破损门扉外的阴影中。

source: The small guest bedroom, previously assumed to be unoccupied, as there had been no unfamiliar shoes in the well. Nor had he seen a foreign jacket in the closet.
zh_cn: 是那间狭小的客房，宗介先前认为那里是空置的，因为柜子里没有发现陌生的鞋子，衣柜里也没有其他外套。

source: No, nobody should have been in there...
zh_cn: 是的，那里应该没人在...

source: Yet, he had distinctly heard the shifting of cloth, followed by the faint, wooden groan of settling furniture.
zh_cn: 不过，他的确听到了衣物摩擦的声音以及木制家具的细微响动。

source: He was on his feet in an instant, shielding Kaname from view.
zh_cn: 他迅速站起，将小要掩蔽在射界之外。

source: "Quiet!" he hissed, his trusty gun in his grip in record time.
zh_cn: “别动！”他悄声说道，下一秒已持枪在手。

source: "There's someon- urgh!"
zh_cn: “那里有人——”

source: Apparently, Sosuke wasn't the only one who had achieved record time.
zh_cn: 显然，宗介并不是唯一听到声响的人。

source: Kaname rested her large paper fan against her shoulder as she glared down at the crumpled form of her husband.
zh_cn: 小要把她的大纸扇靠在肩上，狠狠地瞪着她丈夫弯着身子曲成一团的样子（这里要看过动画的才明白了，话说小要还是那么剽悍啊...）。

source: "Of course I know there's someone in there!" she snapped, placing her free hand on her hip and gracing Sosuke with a glower. "That's what I was trying to tell you!"...that was somewhat unexpected.
zh_cn: “我当然知道那里有人！”她叫道，另一只手叉着腰，对丈夫怒目而视，“这就是我想要告诉你的！”...这多少有些出乎意料。

source: "A visitor?"
zh_cn: “一个客人？”

source: Sosuke's head popped up from the linoleum, as nonchalant as if he had never been assaulted.
zh_cn: 宗介的头从地毯下冒出来说，竭力显出一副没被攻击过的平淡样子。

source: He straightened his battered body, and (though still wary) grudgingly consented to put his weapon away.
zh_cn: 他挺直了饱受摧残的身躯，而且（但是看起来还是十分警觉）勉强同意放下手中的武器。

source: "Is it someone I know?"
zh_cn: “我认识的人吗？”

source: The question was innocent enough- or so the soldier thought- but even still, it made his wife blush and stutter.
zh_cn: 这个问题其实很普通——或者只是宗介自己如此想到——但是这还是让他的妻子面红耳赤。

source: How curious. What was so upsetting about company?
zh_cn: 太奇怪了，为什么这个访客令人这么心烦意乱？

source: What did a guest have to do with his emotional state?
zh_cn: 一个客人和自己的情绪有什么关系？

source: And where were this person's shoes?
zh_cn: 而且他的鞋哪儿去了？

source: This was all quite mystifying.
zh_cn: 这都太让人不解了。

source: Perhaps further investigation would still be required, despite the so called "safety" of the situation.
zh_cn: 也许还是要进行进一步的侦查，尽管现在看来还算“安全”。

source: "...fine, then.
zh_cn: “...好吧。

source: I shall go look for myself," Sosuke decreed after a fruitless moment of waiting for an answer.
zh_cn: 我要自己去看个究竟。”发现得不到答复，宗介做了这样的决定。

source: If Kaname didn't want to tell him who their guest was, it could hardly bode well for him.
zh_cn: 如果小要不想让他知道客人是谁，对他来说可不算是个好兆头。

source: Perhaps an old lover?
zh_cn: 或许是旧情人？

source: No, that was hardly likely...
zh_cn: 不，看起来不太可能（宗介，乃真是自信，GJ!）...

source: Maybe one of their friends had fallen on difficult times, and she didn't want to say anything that might hurt their feelings?
zh_cn: 可能是他们的一个陷入窘境的老朋友，而她什么都没说，以免伤了对方的感情？

source: That seemed probable, the economy being what it was...
zh_cn: 这很有可能，经济问题总是...

source: So deep in thought was he, the soldier didn't fully register the pleas of "Um- no, wait, Sosuke! I should really explain, first! After you le- !" that echoed from behind him, nor the scampering scuffle of slipper-covered feet as Kaname rushed after.
zh_cn: 他这么陷入深思，没能听清他身后回响着的小要的恳求，“嗯——不，等等，宗介！先让我解释！在你走——！”也没听到身后拖鞋踢踢踏踏追上来的响动。

source: He pushed into the spare bedroom without a problem- apparently Kaname had disarmed his booby traps while he was away; he'd have to talk to her about that later- and only paused briefly when he noticed the change in decor.
zh_cn: 他毫无障碍地推开了门——很显然小要已经拆除了他走之前装好的诡雷，之后可得好好和她说说这事——在注意到房内装饰的变化后他只是稍稍停顿了一下。

source: It was hard to make out through the nighttime shadows, but there was a strange box in the middle of the floor, like a little wooden cage.
zh_cn: 很难看清夜里黑沉沉的房间，不过在中央有一个古怪的箱子，像是一个小小的木笼。

source: "- ady been for a few mon- "
zh_cn: “——后的几个月——”

source: The Mithril sergeant squinted, head cocked as he tried to distinguish the strange forms that lurked in the gloom.
zh_cn: 秘银的军士歪着头想要看清那些潜伏在阴影中的奇怪物体。

source: He could discern a dresser with a fair level of certainty, as well as a spare chair.
zh_cn: 他能够分辨出一个梳妆台，还有一把备用的椅子。

source: But there were other outlines that he could not classify; blobs in the corners of the room- blobs that had definitely not been there before he'd left.
zh_cn: 但是还有些东西的轮廓他没法辨认，那些房间死角的斑点——这些斑点在他离开前肯定不存在。

source: And he was unsure what the strange contraption dangling from the ceiling was, or what to make of the dangerous-looking silhouettes atop the drawers.
zh_cn: 而且他也没办法确认那些天花板上吊着的奇怪装置，或者柜子上那些看上去十分危险的阴影。

source: That cage, too, caused him some degree of concern.
zh_cn: 那个笼子也吸引了他的注意力。

source: Cautiously, he took three steps towards it, twitching fingers inching over the head of his pistol...
zh_cn: 他谨慎地向内迈出三步，颤动的手指缓缓移向手枪...

source: "- re you even listening to me?"
zh_cn: “——你听到我的话了吗？”

source: A sharp click; the room exploded with rosy lamp light.
zh_cn: 突然间，房间被玫瑰色的灯光点亮。

source: And Sosuke found himself staring owlishly around a room that he no longer recognized.
zh_cn: 宗介发现自己正警觉地凝视着一个他不再熟悉的房间。

source: From the ceiling hung a mobile of different colors and shapes; atop the dresser were lines of toy ASes, a battle tank, and a miniature submarine; the blobs had transformed into stuffed animals and Bonta-kuns.
zh_cn: 天花板上吊着各种颜色和形状的活动小玩意，柜子上摆着一排AS玩具（AS，Armed Slave，FMP中的先进主战兵器，一般译为强袭机兵，译注）、一辆主战坦克和一艘缩小的潜水艇的模型，房间四角的“斑点”变成了绒毛动物和BON太君（FMP中类似吉祥物的存在，外形如同一只胖胖的老鼠，译注）的玩具。

source: And the cage that the trained soldier had so carefully approached wasn't a cage at all- it was a crib, filled with pink blankets and a teeny, tiny, brown-haired newborn.
zh_cn: 而之前训练有素的士兵小心靠近的笼子根本就是不是一个“笼子”——那是一个婴儿床，满是粉色的毛毯，和一个小小的软软的，棕色头发的婴儿。

source: For a full minute, the mercenary couldn't speak.
zh_cn: 整整一分钟，雇佣兵没法开口。

source: Couldn't move.
zh_cn: 也没法移动。

source: Couldn't breathe.
zh_cn: 没法呼吸。

source: The spell only broke when the little body in the cradle decided to roll over (again), curling more tightly around the toy gun that she held in her chubby baby arms.
zh_cn: 直到小宝宝（又）翻了一次身，把胖胖的小胳膊中的玩具枪抱得更紧了之后，静默的咒语才被打破。

source: Sosuke turned slowly to face his wife, the pieces rapidly coming together in his mind.
zh_cn: 宗介缓缓地把脸转向他的妻子，无数念头一起涌上他的脑海。

source: "Um... Kaname...?" he choked, tanned cheeks pinking adorably as realization finally set in.
zh_cn: “呃...小要...？”他呛了口气，终于弄明白情况之后晒黑的脸颊浮现出红晕。

source: "Is this child... is she my...?"
zh_cn: “这孩子...她是我的...？”

source: Kaname smiled sheepishly, even as she blushed and nodded.
zh_cn: 小要羞怯地笑了，同时红着脸点了点头。

source: "Surprise...?"
zh_cn: “惊讶吗？”
